#!/bin/bash
#########################################################
#计算文档每行出现的数字个数，并计算整个文档的数字总数
########################################################
#使用awk只输出文档行数（截取第一段）
n=$(wc -l a.txt | awk '{print $1}')
sum=0
#文档中每一行可能存在空格，因此不能直接用文档内容进行遍历
# shellcheck disable=SC1073
for i in $(seq 1 $n); do
  # 输出的行用变量表示时，需要用双引号
  # wc -L选项，统计最长行的长度
  line=$(sed -n "$i"p a.txt)
  n_n=$(echo $line | sed s'/[^0-9]//'g | wc -L)
  echo $n_nsum=$(($sum + $n_n))
done

echo "sum:$sum"

################################################################
#有一些脚本加入到了cron之中，存在脚本尚未运行完毕又有新任务需要执行的情况，
#导致系统负载升高，因此可通过编写脚本，筛选出影响负载的进程一次性全部杀死。
################################################################
ps aux | grep 指定进程名 | grep -v grep | awk '{print $2}' | xargs kill -9
